site.org
#+HUGO_BASE_DIR: .
#+MACRO: uva @@hugo:{{<UVa2 number="$1" >}}@@


** Divide and Conquer
:PROPERTIES:
:EXPORT_FILE_NAME: divide_and_conquer
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :weight 5 :date 2022-08-22 :publishdate 2022-07-01
:ID:       99caeb59-31db-4e9d-a2cd-7c905eddedc0
:END:

Divide and Conquer is an algorithmic strategy that involves breaking a complex problem  into smaller, more manageable
sub-problems. There are three steps: "Divide" the problem into smaller instances, "Conquer" these instances
(either by solving them directly or recursively applying the strategy), and then "Combine" the solutions of these
sub-problems to form the solution for the original problem.

A classic example of this approach is the Merge Sort algorithm: the array is divided into two halves, each half is
recursively sorted, and then the two sorted halves are merged together.

*** Slides
- [[/slides/divide-and-conquer.pdf][Divide and Conquer Slides]]

