content/lectures/divide_and_conquer.md
+++
title = "Divide and Conquer"
draft = false
weight = 5
date = 2022-08-22
publishdate = 2022-07-01
+++

Divide and Conquer is an algorithmic strategy that involves breaking a complex problem  into smaller, more manageable
sub-problems. There are three steps: "Divide" the problem into smaller instances, "Conquer" these instances
(either by solving them directly or recursively applying the strategy), and then "Combine" the solutions of these
sub-problems to form the solution for the original problem.

A classic example of this approach is the Merge Sort algorithm: the array is divided into two halves, each half is
recursively sorted, and then the two sorted halves are merged together.


## Slides {#slides}

-   [Divide and Conquer Slides](/slides/divide-and-conquer.pdf)
